app/Controllers/WebController.php

SELECT COUNT(*) AS `numrows` FROM `users`
SELECT COUNT(*) AS `numrows` FROM `subscriptions`
SELECT COUNT(*) AS `numrows`
FROM `subscriptions`
WHERE `status` = 'active'
SELECT SUM(price) as total
FROM `subscriptions`
WHERE `status` = 'active'
 LIMIT 1
---
    public function adminDashboard()
    {
        // Check admin access
        if (!$this->session->get('isLoggedIn') || !$this->session->get('is_admin')) {
            return redirect()->to('/login');
        }

        // Get dashboard statistics
        $totalUsers = $this->userModel->countAll();
        $totalSubscriptions = $this->subscriptionModel->countAll();
        $activeSubscriptions = $this->subscriptionModel->where('status', 'active')->countAllResults();
        $totalContacts = $this->contactModel->countAll();
        $unreadContacts = $this->contactModel->where('status', 'unread')->countAllResults();

        // Calculate MRR (Monthly Recurring Revenue)
        $mrr = $this->subscriptionModel
            ->select('SUM(price) as total')
            ->where('status', 'active')
            ->first()['total'] ?? 0;

SELECT COUNT(*) AS `numrows`
FROM `subscriptions`
WHERE `created_at` >= '2025-02-01'
AND `created_at` <= '2025-02-28 23:59:59'
SELECT SUM(price) as total
FROM `subscriptions`
WHERE `status` = 'active'
AND `created_at` <= '2025-02-28 23:59:59'
 LIMIT 1
---
            $monthName = date('M', strtotime("-$i months")); // Format pendek: Jan, Feb, Mar

            // Count new subscriptions in this month
            $newSubscriptions = $this->subscriptionModel
                ->where('created_at >=', $date)
                ->where('created_at <=', $monthEnd . ' 23:59:59')
                ->countAllResults();

            // Calculate revenue for this month (active subscriptions created before or during this month)
            $monthlyRevenue = $this->subscriptionModel
                ->select('SUM(price) as total')
                ->where('status', 'active')
                ->where('created_at <=', $monthEnd . ' 23:59:59')
                ->first()['total'] ?? 0;

SELECT COUNT(*) AS `numrows`
FROM `subscriptions`
WHERE `created_at` >= '2025-07-01'
SELECT COUNT(*) AS `numrows`
FROM `subscriptions`
WHERE `created_at` >= '2025-06-01'
AND `created_at` < '2025-07-01'
---
        $currentMonth = date('Y-m-01');
        $lastMonth = date('Y-m-01', strtotime('-1 month'));

        $currentMonthSubscriptions = $this->subscriptionModel
            ->where('created_at >=', $currentMonth)
            ->countAllResults();

        $lastMonthSubscriptions = $this->subscriptionModel
            ->where('created_at >=', $lastMonth)
            ->where('created_at <', $currentMonth)
            ->countAllResults();

SELECT `subscriptions`.*, `users`.`name` as `user_name`, `users`.`email` as `user_email`
FROM `subscriptions`
JOIN `users` ON `users`.`id` = `subscriptions`.`user_id`
ORDER BY `subscriptions`.`created_at` DESC
 LIMIT 10
---
            : 0;

        // Get recent subscriptions
        $recentSubscriptions = $this->subscriptionModel
            ->select('subscriptions.*, users.name as user_name, users.email as user_email')
            ->join('users', 'users.id = subscriptions.user_id')
            ->orderBy('subscriptions.created_at', 'DESC')
            ->limit(10)
            ->findAll();

SELECT *
FROM `subscriptions`
WHERE `user_id` = '6'
ORDER BY `created_at` DESC
---
    public function userDashboard()
    {
        // Check user access
        if (!$this->session->get('isLoggedIn')) {
            return redirect()->to('/login');
        }

        $userId = $this->session->get('user_id');  // Use consistent key

        // Get user subscriptions
        $subscriptions = $this->subscriptionModel
            ->where('user_id', $userId)
            ->orderBy('created_at', 'DESC')
            ->findAll();