app/Models/SubscriptionModel.php

    public function getSubscriptionStats()
    {
        $stats = [];

        // Total subscriptions
        $stats['total'] = $this->countAll();

        // Active subscriptions
        $stats['active'] = $this->where('status', 'active')->countAllResults(false);

        // Paused subscriptions
        $stats['paused'] = $this->where('status', 'paused')->countAllResults(false);

        // Cancelled subscriptions
        $stats['cancelled'] = $this->where('status', 'cancelled')->countAllResults(false);

        // This month's subscriptions
        $stats['this_month'] = $this->where('MONTH(created_at)', date('m'))
            ->where('YEAR(created_at)', date('Y'))
            ->countAllResults(false);

        // Revenue this month
        $revenue = $this->selectSum('price')
            ->where('MONTH(created_at)', date('m'))
            ->where('YEAR(created_at)', date('Y'))
            ->where('status !=', 'cancelled')
            ->first();
---
SELECT COUNT(*) AS `numrows` FROM `subscriptions`
SELECT COUNT(*) AS `numrows`
FROM `subscriptions`
WHERE `status` = 'active'
SELECT COUNT(*) AS `numrows`
FROM `subscriptions`
WHERE `status` = 'active'
AND `status` = 'paused'
SELECT COUNT(*) AS `numrows`
FROM `subscriptions`
WHERE `status` = 'active'
AND `status` = 'paused'
AND `status` = 'cancelled'
SELECT SUM(`price`) AS `price`
FROM `subscriptions`
WHERE `status` = 'active'
AND `status` = 'paused'
AND `status` = 'cancelled'
AND MONTH(created_at) = '07'
AND YEAR(created_at) = '2025'
AND MONTH(created_at) = '07'
AND YEAR(created_at) = '2025'
AND `status` != 'cancelled'
 LIMIT 1