app/Models/UserModel.php

SELECT *
FROM `users`
WHERE `email` = 'agnankun18@gmail.com'
 LIMIT 1
---
    public function findByEmail(string $email)
    {
        $result = $this->where('email', $email)->first();